tiborsimon/embedded-tdd-headers/pic/8bit/pic18f86j94_tdd.h
#define SSP2CON2_ADMSK3               2207
#define ACKEN2                        2208
#define ADMSK42                       2209
#define SSP2CON2_ADMSK4               2210
#define SSP2CON2_ACKEN                2211
#define ACKDT2                        2212
#define ADMSK52                       2213
#define SSP2CON2_ACKDT                2214
#define SSP2CON2_ADMSK5               2215
#define SSP2CON2_ACKSTAT              2216
#define ACKSTAT2                      2217
#define GCEN2                         2218
#define SSP2CON2_GCEN                 2219
#define SSP2CON1                      2220
#define SSP2CON1_SSPM                 2221
#define SSP2CON1_SSPM0                2222
#define SSPM02                        2223
#define SSPM12                        2224
#define SSP2CON1_SSPM1                2225
#define SSP2CON1_SSPM2                2226
#define SSPM22                        2227
#define SSPM32                        2228
#define SSP2CON1_SSPM3                2229
#define SSP2CON1_CKP                  2230
#define CKP2                          2231
#define SSPEN2                        2232
#define SSP2CON1_SSPEN                2233
#define SSPOV2                        2234
#define SSP2CON1_SSPOV                2235
#define WCOL2                         2236
#define SSP2CON1_WCOL                 2237
#define SSP2STAT                      2238
#define SSP2STAT_BF                   2239
#define BF2                           2240
#define SSP2STAT_UA                   2241
#define UA2                           2242
#define SSP2STAT_R_W                  2243
#define RW2                           2244
#define SSP2STAT_nWRITE               2245
#define SSP2STAT_nW                   2246
#define READ_WRITE2                   2247
#define nW2                           2248
#define SSP2STAT_I2C_READ             2249
#define I2C_READ2                     2250
#define SSP2STAT_R_NOT_W              2251
#define R_nW2                         2252
#define SSP2STAT_READ_WRITE           2253
#define nWRITE2                       2254
#define R_W2                          2255
#define SSP2STAT_R_nW                 2256
#define SSP2STAT_NOT_WRITE            2257
#define SSP2STAT_S                    2258
#define S2                            2259
#define START2                        2260
#define SSP2STAT_I2C_START            2261
#define I2C_START2                    2262
#define P2                            2263
#define SSP2STAT_I2C_STOP             2264
#define STOP2                         2265
#define SSP2STAT_P                    2266
#define I2C_STOP2                     2267
#define I2C_DAT2                      2268
#define DATA_ADDRESS2                 2269
#define SSP2STAT_D_NOT_A              2270
#define SSP2STAT_I2C_DAT              2271
#define D_A2                          2272
#define SSP2STAT_NOT_ADDRESS          2273
#define SSP2STAT_D_nA                 2274
#define SSP2STAT_DATA_ADDRESS         2275
#define SSP2STAT_nADDRESS             2276
#define nA2                           2277
#define DA2                           2278
#define nADDRESS2                     2279
#define SSP2STAT_nA                   2280
#define SSP2STAT_D_A                  2281
#define D_nA2                         2282
#define SSP2STAT_CKE                  2283
#define CKE2                          2284
#define SSP2STAT_SMP                  2285
#define SMP2                          2286
#define PSTR3CON                      2287
#define PSTR3CON_STRA                 2288
#define STRA3                         2289
#define STRB3                         2290
#define PSTR3CON_STRB                 2291
#define PSTR3CON_STRC                 2292
#define STRC3                         2293
#define STRD3                         2294
#define PSTR3CON_STRD                 2295
#define STRSYNC3                      2296
#define PSTR3CON_STRSYNC              2297
#define PSTR3CON_CMPL0                2298
#define CMPL03                        2299
#define PSTR3CON_CMPL                 2300
#define CMPL13                        2301
#define PSTR3CON_CMPL1                2302
#define PSTR2CON                      2303
#define PSTR2CON_STRA                 2304
#define P2DC02                        2305
#define STRA2                         2306
#define P2DC0CON                      2307
#define STRB2                         2308
#define P2DC12                        2309
#define PSTR2CON_STRB                 2310
#define P2DC1CON                      2311
#define STRC2                         2312
#define PSTR2CON_STRC                 2313
#define P2DC22                        2314
#define P2DC2CON                      2315
#define P2DC32                        2316
#define STRD2                         2317
#define PSTR2CON_STRD                 2318
#define P2DC3CON                      2319
#define P2DC4CON                      2320
#define STRSYNC2                      2321
#define PSTR2CON_STRSYNC              2322
#define P2DC42                        2323
#define P2DC6CON                      2324
#define PSTR2CON_CMPL                 2325
#define CMPL02                        2326
#define P2DC62                        2327
#define PSTR2CON_CMPL0                2328
#define CMPL12                        2329
#define PSTR2CON_CMPL1                2330
#define TXREG2                        2331
#define RCREG2                        2332
#define SPBRG2                        2333
#define SPBRG2_BRG0                   2334
#define SPBRG2_BRG1                   2335
#define SPBRG2_BRG2                   2336
#define SPBRG2_BRG3                   2337
#define SPBRG2_BRG4                   2338
#define SPBRG2_BRG5                   2339
#define SPBRG2_BRG6                   2340
#define SPBRG2_BRG7                   2341
#define SPBRGH2                       2342
#define SPBRGH2_BRG8                  2343
#define SPBRGH2_BRG9                  2344
#define SPBRGH2_BRG10                 2345
#define SPBRGH2_BRG11                 2346
#define SPBRGH2_BRG12                 2347
#define SPBRGH2_BRG13                 2348
#define SPBRGH2_BRG14                 2349
#define SPBRGH2_BRG15                 2350
#define DSGPR3                        2351
#define DSGPR2                        2352
#define DSGPR1                        2353
#define DSGPR0                        2354
#define DSWAKEH                       2355
#define DSINT0                        2356
#define DSWAKEL                       2357
#define DSPOR                         2358
#define DSICD                         2359
#define DSMCLR                        2360
#define DSRTC                         2361
#define DSWDT                         2362
#define DSULP                         2363
#define DSWAKEL_BOR                   2364
#define DSFLT                         2365
#define DSCONH                        2366
#define RTCWDIS                       2367
#define DSEN                          2368
#define DSCONL                        2369
#define RELEASE                       2370
#define DSBOR                         2371
#define ULPWDIS                       2372
#define TXREG3                        2373
#define RCREG3                        2374
#define SPBRG3                        2375
#define SPBRG3_BRG0                   2376
#define SPBRG3_BRG1                   2377
#define SPBRG3_BRG2                   2378
#define SPBRG3_BRG3                   2379
#define SPBRG3_BRG4                   2380
#define SPBRG3_BRG5                   2381
#define SPBRG3_BRG6                   2382
#define SPBRG3_BRG7                   2383
#define SPBRGH3                       2384
#define SPBRGH3_BRG8                  2385
#define SPBRGH3_BRG9                  2386
#define SPBRGH3_BRG10                 2387
#define SPBRGH3_BRG11                 2388
#define SPBRGH3_BRG12                 2389
#define SPBRGH3_BRG13                 2390
#define SPBRGH3_BRG14                 2391
#define SPBRGH3_BRG15                 2392
#define BAUDCON3                      2393
#define BAUDCON3_ABDEN                2394
#define BAUDCON3_WUE                  2395
#define BAUDCON3_IREN                 2396
#define BAUDCON3_BRG16                2397
#define BAUDCON3_TXCKP                2398
#define BAUDCON3_RXDTP                2399
#define BAUDCON3_RCIDL                2400
#define BAUDCON3_ABDOVF               2401
#define TXSTA3                        2402
#define TXSTA3_TX9D                   2403
#define TXSTA3_TRMT                   2404
#define TXSTA3_BRGH                   2405
#define TXSTA3_SENDB                  2406
#define TXSTA3_SYNC                   2407
#define TXSTA3_TXEN                   2408
#define TXSTA3_TX9                    2409
#define TXSTA3_CSRC                   2410
#define RCSTA3                        2411
#define RCSTA3_RX9D                   2412
#define RCSTA3_OERR                   2413
#define RCSTA3_FERR                   2414
#define RCSTA3_ADDEN                  2415
#define RCSTA3_CREN                   2416
#define RCSTA3_SREN                   2417
#define RCSTA3_RX9                    2418
#define RCSTA3_SPEN                   2419
#define SPBRGH1_BRG8                  2420
#define SPBRGH1                       2421
#define SPBRGH1_BRG9                  2422
#define SPBRGH1_BRG10                 2423
#define SPBRGH1_BRG11                 2424
#define SPBRGH1_BRG12                 2425
#define SPBRGH1_BRG13                 2426
#define SPBRGH1_BRG14                 2427
#define SPBRGH1_BRG15                 2428
#define BAUDCON2                      2429
#define ABDEN2                        2430
#define BAUDCON2_ABDEN                2431
#define WUE2                          2432
#define BAUDCON2_WUE                  2433
#define BAUDCON2_IREN                 2434
#define BRG162                        2435
#define BAUDCON2_BRG16                2436
#define SCKP2                         2437
#define TXCKP2                        2438
#define BAUDCON2_TXCKP                2439
#define DTRXP2                        2440
#define RXDTP2                        2441
#define BAUDCON2_RXDTP                2442
#define RCMT2                         2443
#define RCIDL2                        2444
#define BAUDCON2_RCIDL                2445
#define BAUDCON2_ABDOVF               2446
#define ABDOVF2                       2447
#define TXSTA2                        2448
#define TXSTA2_TX9D                   2449
#define TXD82                         2450
#define TXSTA2_TRMT                   2451
#define TXSTA2_BRGH                   2452
#define TXSTA2_SENDB                  2453
#define TXSTA2_SYNC                   2454
#define TXSTA2_TXEN                   2455
#define TX8_92                        2456
#define TXSTA2_TX9                    2457
#define TXSTA2_CSRC                   2458
#define RCSTA2                        2459
#define RCD82                         2460
#define RCSTA2_RX9D                   2461
#define RCSTA2_OERR                   2462
#define RCSTA2_FERR                   2463
#define RCSTA2_ADDEN                  2464
#define RCSTA2_CREN                   2465
#define RCSTA2_SREN                   2466
#define RC92                          2467
#define RC8_92                        2468
#define RCSTA2_RX9                    2469
#define RCSTA2_SPEN                   2470
#define CCPTMRS2                      2471
#define C8TSEL0                       2472
#define C8TSEL                        2473
#define C8TSEL1                       2474
#define C9TSEL                        2475
#define C9TSEL0                       2476
#define C10TSEL0                      2477
#define C10TSEL                       2478
#define CCPTMRS1                      2479
#define C4TSEL                        2480
#define C4TSEL0                       2481
#define C4TSEL1                       2482
#define C5TSEL                        2483
#define C5TSEL0                       2484
#define C6TSEL0                       2485
#define C6TSEL                        2486
#define C7TSEL                        2487
#define C7TSEL0                       2488
#define C7TSEL1                       2489
#define CCPTMRS0                      2490
#define C1TSEL0                       2491
#define C1TSEL                        2492
#define C1TSEL1                       2493
#define C1TSEL2                       2494
#define C2TSEL0                       2495
#define C2TSEL                        2496
#define C2TSEL1                       2497
#define C2TSEL2                       2498
#define C3TSEL0                       2499
#define C3TSEL                        2500
#define C3TSEL1                       2501
#define CM3CON                        2502
#define CM3CON_CCH                    2503
#define CCH03                         2504
#define CM3CON_CCH0                   2505
#define CCH13                         2506
#define CM3CON_CCH1                   2507
#define CM3CON_CREF                   2508
#define CREF3                         2509
#define CM3CON_EVPOL                  2510
#define EVPOL03                       2511
#define CM3CON_EVPOL0                 2512
#define CM3CON_EVPOL1                 2513
#define EVPOL13                       2514
#define CM3CON_CPOL                   2515
#define CPOL3                         2516
#define COE3                          2517
#define CM3CON_COE                    2518
#define CM3CON_CON                    2519
#define CON3                          2520
#define CM2CON                        2521
#define CM2CON_CCH                    2522
#define CM2CON_CCH0                   2523
#define CCH02                         2524
#define CCH12                         2525
#define CM2CON_CCH1                   2526
#define CM2CON_CREF                   2527
#define CREF2                         2528
#define CM2CON_EVPOL                  2529
#define EVPOL02                       2530
#define CM2CON_EVPOL0                 2531
#define EVPOL12                       2532
#define CM2CON_EVPOL1                 2533
#define CM2CON_CPOL                   2534
#define CPOL2                         2535
#define CM2CON_COE                    2536
#define COE2                          2537
#define CM2CON_CON                    2538
#define CON2                          2539
#define SSP2CON3                      2540
#define SSP2CON3_DHEN                 2541
#define SSP2CON3_AHEN                 2542
#define SSP2CON3_SBCDE                2543
#define SSP2CON3_SDAHT                2544
#define SSP2CON3_BOEN                 2545
#define SSP2CON3_SCIE                 2546
#define SSP2CON3_PCIE                 2547
#define SSP2CON3_ACKTIM               2548
#define T8CON                         2549
#define T8CKPS0                       2550
#define T8CKPS                        2551
#define T8CKPS1                       2552
#define TMR8ON                        2553
#define T8OUTPS                       2554
#define T8OUTPS0                      2555
#define T8OUTPS1                      2556
#define T8OUTPS2                      2557
#define T8OUTPS3                      2558
#define PR8                           2559
#define TMR8                          2560
#define T6CON                         2561
#define T6CKPS0                       2562
#define T6CKPS                        2563
#define T6CKPS1                       2564
#define TMR6ON                        2565
#define T6OUTPS0                      2566
#define T6OUTPS                       2567
#define T6OUTPS1                      2568
#define T6OUTPS2                      2569
#define T6OUTPS3                      2570
#define PR6                           2571
#define TMR6                          2572
#define CCP10CON                      2573
#define CCP10M                        2574
#define CCP10M0                       2575
#define CCP10M1                       2576
#define CCP10M2                       2577
#define CCP10M3                       2578
#define CCP10Y                        2579
#define DC10B0                        2580
#define DC10B                         2581
#define CCP10X                        2582
#define DC10B1                        2583
#define CCPR10L                       2584
#define CCPR10H                       2585
#define CCP9CON                       2586
#define CCP9M0                        2587
#define CCP9M                         2588
#define CCP9M1                        2589
#define CCP9M2                        2590
#define CCP9M3                        2591
#define CCP9Y                         2592
#define DC9B0                         2593
#define DC9B                          2594
#define CCP9X                         2595
#define DC9B1                         2596
#define CCPR9L                        2597
#define CCPR9H                        2598
#define CCP8CON                       2599
#define CCP8M0                        2600
#define CCP8M                         2601
#define CCP8M1                        2602
#define CCP8M2                        2603
#define CCP8M3                        2604
#define DC8B0                         2605
#define CCP8Y                         2606
#define DC8B                          2607
#define DC8B1                         2608
#define CCP8X                         2609
#define CCPR8L                        2610
#define CCPR8H                        2611
#define CCP3CON                       2612
#define CCP3M                         2613
#define CCP3M0                        2614
#define CCP3M1                        2615
#define CCP3M2                        2616
#define CCP3M3                        2617
#define CCP3Y                         2618
#define DC3B                          2619
#define DC3B0                         2620
#define DC3B1                         2621
#define CCP3X                         2622
#define P3M                           2623
#define P3M0                          2624
#define P3M1                          2625
#define CCPR3L                        2626
#define CCPR3H                        2627
#define ECCP3DEL                      2628
#define P3DC                          2629
#define P3DC0                         2630
#define P3DC1                         2631
#define P3DC2                         2632
#define P3DC3                         2633
#define P3DC4                         2634
#define P3DC5                         2635
#define P3DC6                         2636
#define P3RSEN                        2637
#define PSS3BD0                       2638
#define PSS3BD                        2639
#define PSS3BD1                       2640
#define PSS3AC0                       2641
#define PSS3AC                        2642
#define PSS3AC1                       2643
#define ECCP3AS                       2644
#define ECCP3AS0                      2645
#define ECCP3AS1                      2646
#define ECCP3AS2                      2647
#define ECCP3ASE                      2648
#define CCP2CON                       2649
#define CCP2M                         2650
#define CCP2M0                        2651
#define CCP2M1                        2652
#define CCP2M2                        2653
#define CCP2M3                        2654
#define DC2B                          2655
#define DC2B0                         2656
#define CCP2Y                         2657
#define DC2B1                         2658
#define CCP2X                         2659
#define P2M                           2660
#define P2M0                          2661
#define P2M1                          2662
#define CCPR2L                        2663
#define CCPR2H                        2664
#define ECCP2DEL                      2665
#define P2DC                          2666
#define P2DC0                         2667
#define P2DC1                         2668
#define P2DC2                         2669
#define P2DC3                         2670
#define P2DC4                         2671
#define P2DC5                         2672
#define P2DC6                         2673
#define P2RSEN                        2674
#define PSS2BD                        2675
#define PSS2BD0                       2676
#define PSS2BD1                       2677
#define PSS2AC0                       2678
#define PSS2AC                        2679
#define PSS2AC1                       2680
#define ECCP2AS0                      2681
#define ECCP2AS                       2682
#define ECCP2AS1                      2683
#define ECCP2AS2                      2684
#define ECCP2ASE                      2685
#define CM1CON                        2686
#define CM1CON_CCH                    2687
#define C1CH0                         2688
#define CM1CON_CCH0                   2689
#define CCH01                         2690
#define CCH11                         2691
#define C1CH1                         2692
#define CM1CON_CCH1                   2693
#define CM1CON_CREF                   2694
#define CREF1                         2695
#define EVPOL01                       2696
#define CM1CON_EVPOL0                 2697
#define CM1CON_EVPOL                  2698
#define CM1CON_EVPOL1                 2699
#define EVPOL11                       2700
#define CM1CON_CPOL                   2701
#define CPOL1                         2702
#define CM1CON_COE                    2703
#define COE1                          2704
#define CM1CON_CON                    2705
#define CON1                          2706
#define PADCFG1                       2707
#define RLPU                          2708
#define PMPTTL                        2709
#define RKPU                          2710
#define PADCFG1_RJPU                  2711
#define RHPU                          2712
#define RGPU                          2713
#define RFPU                          2714
#define REPU                          2715
#define RDPU                          2716
#define IOCN                          2717
#define IOCN0                         2718
#define IOCN1                         2719
#define IOCN2                         2720
#define IOCN3                         2721
#define IOCN4                         2722
#define IOCN5                         2723
#define IOCN6                         2724
#define IOCN7                         2725
#define IOCP                          2726
#define IOCP0                         2727
#define IOCP1                         2728
#define IOCP2                         2729
#define IOCP3                         2730
#define IOCP4                         2731
#define IOCP5                         2732
#define IOCP6                         2733
#define IOCP7                         2734
#define RTCCON2                       2735
#define RTCSECSEL                     2736
#define RTCSECSEL0                    2737
#define RTCSECSEL1                    2738
#define RTCCLKSEL0                    2739
#define RTCCLKSEL                     2740
#define RTCCLKSEL1                    2741
#define PWCSPRE                       2742
#define PWCCPRE                       2743
#define PWCPOL                        2744
#define PWCEN                         2745
#define ALRMVALL                      2746
#define ALRMVALH                      2747
#define ALRMRPT                       2748
#define ARPT0                         2749
#define ARPT                          2750
#define ARPT1                         2751
#define ARPT2                         2752
#define ARPT3                         2753
#define ARPT4                         2754
#define ARPT5                         2755
#define ARPT6                         2756
#define ARPT7                         2757
#define ALRMCFG                       2758
#define ALRMPTR                       2759
#define ALRMPTR0                      2760
#define ALRMPTR1                      2761
#define AMASK0                        2762
#define AMASK                         2763
#define AMASK1                        2764
